clean_2412/4/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          860;
        startFace       360370;
    }
    outlet
    {
        type            patch;
        nFaces          420;
        startFace       361230;
    }
    porosityWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          380;
        startFace       361650;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          361200;
        startFace       362030;
    }
)

// ************************************************************************* //
